# Задача 1️⃣
# Напишіть однорядковий код, який перевіряє, чи може робот перемогти людство. Ну або, принаймні, перевіряє чи введений рік буде високосним.
while (year := input("Введіть рік (наприклад, 2024) або 'stop', якщо ви не хочете дізнатись, чи цей рік - рік повстання роботів. Проте все і так летить до біса: ")) != 'stop': print((lambda y: globals().update({'year': int(y)}) or ('Цей рік високосний! Роботи готують Ocean of Dream ;)!' if year % 4 == 0 and (year % 100 != 0 or year % 400 == 0) else 'Звичайний рік. Донатьне на ЗСУ, спіть 8 годин, пийте воду!'))(year))

# Задача 2️⃣
# Створіть однорядковий код, що збирає всі загублені носки з прання, тобто знаходить унікальні елементи в масиві і сортує їх.
while (socks_input := input("Введіть список шкарпеток (наприклад, [1, 2, 3, 2, 4, 5]) або 'stop', якщо змирилися з втратою: ")) != 'stop': print((lambda socks: f"Тримайте: {sorted(set(socks))}" if socks else "Всі шкарпетки зникли в таємничу чорну діру прання! Пора кликати детектива!")(eval(socks_input)))

# Задача 3️⃣
# Напишіть однорядковий код, що перевіряє, чи є текст вашим найкращим другом (паліндромом).
while (palindrome_input := input("Введіть текст для перевірки на паліндром (наприклад, level) або 'stop', якщо не хочете шукати дзеркальне відображення: ")) != 'stop': print((lambda text: "Так, паліндром! Це слово таке ж прекрасне з обох сторін, як вафельний торт!" if text == text[::-1] else "Не паліндром, але теж непогано!")(palindrome_input))

# Задача 4️⃣
# Напишіть код, що генерує абсолютно випадкове число від 1 до 100… але без генератора випадкових чисел. Ви ж таке можете, чи не так?
while (random_input := input("Введіть будь-який текст або 'stop', якщо не хочете викликати числовий хаос: ")) != 'stop': print((lambda text: sum(ord(c) for c in text) % 100 + 1)(random_input))

# Задача 5️⃣
# Створіть однорядковий код, який зібрав би всіх домашніх улюбленців з інтернету в один масив, але по факту — просто стисніть великий текст так, щоб його можна було прочитати людині.
while (compression_input := input("Введіть текст для стиснення (наприклад, 'Батько наш - Бандера, Україна - мати, Ми за Україну будем воювати!') або 'stop', бо ви і без скорочень знаєте все: ")) != 'stop': print(' '.join(word[:3] + '-' + word[-2:] if len(word) > 5 else word for word in compression_input.split()))
